In [27]:
import os
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df_rel = pd.read_csv('titanic/rel1.csv')

In [3]:
df_rel

        Sex     Fare  Age  Survived
0      male   7.2500   22         0
1    female  71.2833   38         1
2    female   7.9250   26         1
3    female  53.1000   35         1
4      male   8.0500   35         0
..      ...      ...  ...       ...
709  female  29.1250   39         0
710    male  13.0000   27         0
711  female  30.0000   19         1
712    male  30.0000   26         1
713    male   7.7500   32         0

[714 rows x 4 columns]

In [10]:
x = [i for i in df_rel['Sex'] if df_rel['Sex'].dtype == 'object']

In [12]:
len(x)

714

In [23]:
#df_rel[feature] = [df_rel[feature].astype("category").cat.codes for feature in df_rel.columns if df_rel[feature].dtype == 'object']

for feature in df_rel:
    if df_rel[feature].dtype == 'object':
        df_rel[feature] = df_rel[feature].astype('category').cat.codes

In [24]:
df_rel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 714 entries, 0 to 713
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Sex       714 non-null    int8
 1   Fare      714 non-null    float64
 2   Age       714 non-null    int64
 3   Survived  714 non-null    int64
dtypes: float64(1), int64(2), int8(1)
memory usage: 17.6 KB

In [25]:
df_rel

     Sex     Fare  Age  Survived
0      1   7.2500   22         0
1      0  71.2833   38         1
2      0   7.9250   26         1
3      0  53.1000   35         1
4      1   8.0500   35         0
..   ...      ...  ...       ...
709    0  29.1250   39         0
710    1  13.0000   27         0
711    0  30.0000   19         1
712    1  30.0000   26         1
713    1   7.7500   32         0

[714 rows x 4 columns]

In [37]:
X_train = np.array(pd.DataFrame([df_rel['Sex'], df_rel['Fare'], df_rel['Age']]))

In [46]:
y_train = np.array(df_rel['Survived'])
np.transpose(y_train).shape

(714,)

In [38]:
X_train.shape

(3, 714)

In [39]:
np.transpose(X_train)

array([[ 1.    ,  7.25  , 22.    ],
       [ 0.    , 71.2833, 38.    ],
       [ 0.    ,  7.925 , 26.    ],
       ...,
       [ 0.    , 30.    , 19.    ],
       [ 1.    , 30.    , 26.    ],
       [ 1.    ,  7.75  , 32.    ]])

In [40]:
X_train = np.transpose(X_train)

In [ ]:
fig,ax = plt.subplots(1,1,figsize=(4,4))
plot_